RegiXResources/RegiXAdapters/MVRMPSAdapter/GetMotorVehicleRegistrationInfoRequest.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IRegiXEntryPoint/ExecuteSynchronous</a:Action>
    <a:MessageID>urn:uuid:4ed3b8f7-29eb-43db-8cf7-a699862d7fca</a:MessageID>
    <ActivityId CorrelationId="7104a13d-39b9-40b1-95c3-c15f5eea7a68" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">1ea8d8be-2ec8-401e-bb6a-7b79e231af62</ActivityId>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <ExecuteSynchronous xmlns="http://tempuri.org/">
      <request>
        <Operation>TechnoLogica.RegiX.MVRMPSAdapter.APIService.IMVRMPSAPI.GetMotorVehicleRegistrationInfo</Operation>
        <Argument>
          <MotorVehicleRegistrationRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://egov.bg/RegiX/MVR/MPS/MotorVehicleRegistrationRequest">
            <Identifier>А7801ХО</Identifier>
          </MotorVehicleRegistrationRequest>
        </Argument>
        <CallContext>
          <ServiceURI>132-11123-01.01.2016</ServiceURI>
          <ServiceType>За проверовъчна дейност</ServiceType>
          <EmployeeIdentifier>tl_ytoteva</EmployeeIdentifier>
          <EmployeeNames>Йорданка Тотева</EmployeeNames>
          <EmployeeAditionalIdentifier />
          <EmployeePosition>SW Developer</EmployeePosition>
          <AdministrationOId>2.16.100.1.1.1.1.15</AdministrationOId>
          <AdministrationName>Министерство на транспорта, информационните технологии и съобщенията</AdministrationName>
          <LawReason>За целите на разработката и тестването на RegiX.</LawReason>
          <Remark />
        </CallContext>
        <SignResult>true</SignResult>
        <ReturnAccessMatrix>true</ReturnAccessMatrix>
      </request>
    </ExecuteSynchronous>
  </s:Body>
</s:Envelope>